Repository: mishin/perldoc-ru
Catalog: pod2-ru/tm/groovy2-68-ru-omegat.tmx
Source language: en_us
Languages: ru

source: Wrapper module for all Groovy and Grails functionality
ru: Модуль обёртка для всей функциональности Groovy и Grails

source: Groovy Refactoring
ru: Реорганизация кода Groovy

source: Groovy refactorings
ru: Возможности реорганизации кода Groovy

source: Cannot rename here
ru: Невозможно переименовать здесь

source: Cannot find usages here
ru: Невозможно найти использования здесь

source: Find Usages
ru: Поиск использований

source: <html>Method <b>{0}</b> of class <b>{1}</b>:</html>
ru: <html>Метод <b>{0}</b> класса <b>{1}</b>:</html>

source: &Search from Base Class [{0}]
ru: Поиск, начиная с &базового класса [{0}]

source: <html>Class <b>{0}</b>:</html>
ru: <html>Класс <b>{0}</b>:</html>

source: <html>Constructor <b>{0}</b> of class <b>{1}</b>:</html>
ru: <html>Конструктор <b>{0}</b> класса <b>{1}</b>:</html>

source: <html>Field <b>{0}</b> of class <b>{1}</b>:</html>
ru: <html>Поле <b>{0}</b> класса <b>{1}</b>:</html>

source: <html>Variable <b>{0}</b>:</html>
ru: <html>Переменная <b>{0}</b>:</html>

source: Groovy refactoring is approximate.
ru: Реорганизация кода Groovy является приблизительной.

source: Review all changes.
ru: Всегда проверяйте предлагаемые изменения.

source: Find &Overriding Methods
ru: Поиск переопределяю&щих методов

source: Find &Usages
ru: Поиск &использований

source: Find &All Subtypes
ru: Поиск &всех подтипов

source: Find &Direct Subtypes Only
ru: Поиск &только прямых подтипов

source: Search in &Comments
ru: Поиск в &комментариях

source: Find All SubTypes of <b>{0}</b>
ru: Найти все подтипы <b>{0}</b>

source: Find Direct SubTypes of <b>{0}</b>
ru: Найти прямые подтипы <b>{0}</b>

source: Usages
ru: Использования

source: and
ru: и

source: Overriding Methods
ru: Переопределяющие методы

source: of <b>{0}</b>
ru: <b>{0}</b>

source: Usages of <b>{0}</b>
ru: Использования <b>{0}</b>

source: Groovy Samples
ru: Примеры Groovy

source: Groovy and Grails sample projects
ru: Примеры проектов Groovy и Grails

source: Groovy-Java Demo
ru: Пример совместного использования Groovy и Java

source: NB Project Generators
ru: Создатели проектов NB

source: Project &Folder:
ru: &Папка проекта:

source: Simple Groovy example that provides a JDialog created in the Matisse GUI Builder, with a JTextField that shows a text retrieved from a Groovy class.
ru: Простой пример Groovy, содержащий диалог JDialog (созданный в конструкторе форм Matisse) с текстовым полем. Текстовое поле выводит текст из класса Groovy.

source: Two simple Groovy scripts.
ru: Два простых скрипта Groovy.

source: One generates the source structure of a skeleton NetBeans Platform application, the other generates the source structure of a skeleton NetBeans module.
ru: Один создаёт структуру исходных файлов скелета приложения на основе платформы NetBeans, а другой -- скелета модуля NetBeans.

source: Groovy Home
ru: Папка установки Groovy

source: Groovy installation directory.
ru: Папка установки Groovy.

source: Groovy Objects
ru: Объекты Groovy

source: Groovy home is not set.
ru: Не установлено расположение Groovy.

source: Go to Tools -> Options -> Advanced Options -> Building -> Groovy and specify where Groovy is installed.
ru: Используйте меню Инструменты | Настройки | Дополнительные свойства | Построение | Groovy для указания расположения установки Groovy.

source: After finishing the "Create new..." wizard, go to Tools -> Options -> Building -> Groovy and specify where Groovy is installed.
ru: После завершения мастера создания, перейдите в меню Инструменты | Настройки | Дополнительные свойства | Построение | Groovy и укажите расположение установки Groovy.

source: Then run Tools -> Make WebApp Groovy Compliant action to correct your web application.
ru: Затем выполните действие Инструменты -> Сделать веб-приложение Groovy-совместимым для настройки вашего веб-приложения.

source: Coyote - Groovy Support
ru: Coyote - поддержка Groovy

source: Tools
ru: Инструменты

source: Enables editing and running of scripts written in Groovy language.
ru: Позволяет редактировать и выполнять скрипты, написанные на языке Groovy.

source: The Groovy Support module enables editing and running of user application files written in Groovy language.
ru: Модуль поддержки Groovy позволяет редактировать и выполнять пользовательские приложения, написанные на языке Groovy.

source: This module requires groovy installation on the computer.
ru: Данному модулю необходим установленный groovy.

source: Groovy home page: http://groovy.codehaus.org/
ru: Домашняя страница Groovy: http://groovy.codehaus.org/

source: Make WebApp Groovy Compliant
ru: Сделать веб-приложение Groovy-совместимым

source: Unsupported web.xml version: {0}
ru: Неподдерживаемая версия web.xml: {0}

source: Do you want to make {0} web application Groovy compliant?
ru: Хотите ли вы сделать веб-приложение {0} Groovy-совместимым?

source: Several elements will be added WEB-INF/web.xml deployment descriptor and a few required libraries will be added to the project.
ru: Несколько элементов будут добавлены в описатель развёртывания WEB-INF/web.xml, и несколько библиотек будут добавлены в проект.

source: Confirm web.xml update
ru: Подтверждение обновления web.xml

source: Script {0} started.
ru: Скрипт {0} запущен.

source: Script {0} finished.
ru: Выполнение скрипта {0} завершено.

source: Script {0} failed.
ru: Выполнение скрипта {0} завершилось неудачно.

source: Cannot find {0} library in {1}.
ru: Невозможно найти библиотеку {0} в {1}.

source: The project does not have a build script.
ru: У проекта отсутствует сценарий построения.

source: Run File
ru: Выполнить файл

source: Compile File
ru: Компилировать файл

source: Debug File
ru: Отладить файл

source: Class "{0}" does not have a main method.
ru: У класса "{0}" нет метода main.

source: Groovy configuration
ru: Настройки Groovy

source: &Enable Groovy
ru: &Включить Groovy

source: Enable Groovy
ru: Включить Groovy

source: Enables Groovy support
ru: Включает поддержку Groovy

source: <html>Adds the groovy-all JAR file to the classpath, modifies the build script with groovyc, and excludes .groovy files from the resulting JAR file.</html>
ru: <html>Добавляет архив JAR groovy-all к пути к классам, добавляет компилятор groovyc в скрипт построения и исключает файлы .groovy из конечного архива JAR.</html>

source: Breakpoint reached at line {lineNumber} in {jspName} by thread {threadName}.
ru: Достигнута точка останова на строке {lineNumber} в {jspName} потоком {threadName}.

source: Go to Source
ru: Перейти к исходному коду

source: Customize
ru: Настроить

source: Get Groovy at
ru: Загрузите Groovy с сайта

source: Not Groovy Home
ru: Не является папкой установки Groovy

source: No Groovy Documentation found
ru: Документация Groovy не найдена.

source: Browse for documentation
ru: Выбор папки с документацией

source: Groovy &Doc:
ru: &Документация Groovy:

source: Groovy Doc
ru: Документация Groovy

source: Location of Groovy docs
ru: Расположение документации Groovy

source: Your projects will use groovy-all.jar set in Library Manager
ru: Ваши проекты будут использовать библиотеку groovy-all.jar, установленную в Менеджере библиотек

source: This module takes care of some supportive tasks for Groovy
ru: Данный модуль выполняет некоторые административные задачи по поддержке Groovy

source: Groovy Support
ru: Поддержка Groovy

source: Groovy script execution support
ru: Поддержка выполнения скриптов Groovy

source: Groovy Script
ru: Скрипт Groovy

source: Groovy Class
ru: Класс Groovy

source: Creates a new groovy class.
ru: Создаёт класс groovy.

source: Groovy is a scripting language.
ru: Groovy является скриптовым языком.

source: Creates a new groovy script.
ru: Создаёт скрипт groovy.

source: Groovy will be enabled for this project
ru: Поддержка Groovy будет включена для данного проекта
